&НаКлиенте
Процедура иб_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если НЕ ПустаяСтрока(Объект.НомерВходящегоДокумента) Тогда
		Если ЕстьПохожееПоступление(Объект.Ссылка) Тогда
			ПоказатьОповещениеПользователя("Проверка", 
			НавигационнаяСсылка, 
			"Найдены документы с этим входящим номером по этому контрагенту",
			БиблиотекаКартинок.Информация,
			СтатусОповещенияПользователя.Важное);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ЕстьПохожееПоступление(ДокументПоступления) Экспорт
	
	Если НЕ Константы.ИБ_ПроверятьВходящийНомерПоступлениеТоваровУслуг.Получить() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.ДатаВходящегоДокумента, ГОД) = &ДатаВходящегоДокумента
		|	И СОКРЛП(ПоступлениеТоваровУслуг.НомерВходящегоДокумента) = &НомерВходящегоДокумента
		|	И ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И НЕ ПоступлениеТоваровУслуг.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("ДатаВходящегоДокумента",	 НачалоГода(ДокументПоступления.ДатаВходящегоДокумента));
	Запрос.УстановитьПараметр("НомерВходящегоДокумента", СокрЛП(ДокументПоступления.НомерВходящегоДокумента));
	Запрос.УстановитьПараметр("Контрагент",				 ДокументПоступления.Контрагент);
	Запрос.УстановитьПараметр("Ссылка",	 				 ДокументПоступления.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции // ЕстьПохожееПоступление()