Функция СотрудникиСИстекующимПатентомНаСервере()
		
	Если НЕ Константы.ДБ_УвеломлятьОЗавершенииСроковДействияСтатусовНалогоплательщиковНДФЛ.Получить() Тогда 
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия
	|ПОМЕСТИТЬ ДействующиеСотрудники
	|ИЗ
	|	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних КАК КадроваяИсторияСотрудниковСрезПоследних
	|ГДЕ
	|	НЕ КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия = &ВидСобытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДействующиеСотрудники.Сотрудник КАК Сотрудник,
	|	ДействующиеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.ДействуетДо КАК ДействуетДо,
	|	РАЗНОСТЬДАТ(&ТекущаяДата, ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.ДействуетДо, ДЕНЬ) КАК ОсталосьДней
	|ИЗ
	|	ДействующиеСотрудники КАК ДействующиеСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ КАК ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ
	|		ПО (ДействующиеСотрудники.ФизическоеЛицо = ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.ФизическоеЛицо)
	|ГДЕ
	|	РАЗНОСТЬДАТ(&ТекущаяДата, ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.ДействуетДо, ДЕНЬ) < 30";
	
	Запрос.УстановитьПараметр("ВидСобытия", Перечисления.ВидыКадровыхСобытий.Увольнение);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
КонецФункции // ФизическиеЛицаСИстекующимПатентомНаСервере()

Функция СотрудникиСИстекующимПатентом() Экспорт
	Возврат СотрудникиСИстекующимПатентомНаСервере();
КонецФункции // ФизическиеЛицаСИстекующимПатентом()
