
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура иб_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ИБ_ИспользоватьПодсказкуПоАдресамDadata = Константы.ИБ_ИспользоватьПодсказкуПоАдресамDadata.Получить();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура иб_ПредставлениеИностранногоАдресаАвтоПодборПосле(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ИБ_ИспользоватьПодсказкуПоАдресамDadata Тогда
		
		Подсказки = ИБ_DaData.ПодсказкаПоАдресам(Текст);
		
		Если Подсказки.suggestions.Количество() > 0 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДанныеВыбора = Новый СписокЗначений;
			
			Для Каждого Адрес Из Подсказки.suggestions Цикл 
				ДанныеВыбора.Добавить(Адрес.unrestricted_value, Адрес.unrestricted_value);	
			КонецЦикла;
			
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

