
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ДБ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДБ_ИспользоватьПодсказкуDadata = ДБ_DaData.ИспользоватьПодсказкуDadata();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДБ_ПредставлениеИностранногоАдресаАвтоПодборПосле(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ДБ_ИспользоватьПодсказкуDadata Тогда
		
		Подсказки = ДБ_DaData.ПодсказкаПоАдресам(Текст);
		
		Если Подсказки.suggestions.Количество() > 0 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДанныеВыбора = Новый СписокЗначений;
			
			Для Каждого Адрес Из Подсказки.suggestions Цикл 
				ДанныеВыбора.Добавить(Адрес.unrestricted_value, Адрес.unrestricted_value);	
			КонецЦикла;
			
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

