
&После("ПередЗаписью")
Процедура иб_ПередЗаписью(Отказ)
	
	Если Константы.ИБ_ЗапретДублейНоменклатуры.Получить() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование = &Наименование
		|	И НЕ Номенклатура.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ТекстСообщения = НСтр(СтрШаблон("ru = 'Уже есть номенклатура с таким наименованием!'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , "Объект", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
