
&ИзменениеИКонтроль("ОткрыватьДополнительныеОкнаПриЗапуске")
Функция ДБ_ОткрыватьДополнительныеОкнаПриЗапуске()

	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.Организации) Тогда
		// Дополнительные окна предназначены только для регулярных пользователей
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Организация.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организация";

#Удаление
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
#КонецУдаления
#Вставка

	Если Константы.ДБ_ОтключитьДополнительныеОкнаПриЗапуске.Получить() Тогда
		Возврат Ложь;
	Иначе
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
#КонецВставки

КонецФункции
