 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючОбъекта  = "DaData.ru";
	КлючНастроек = "DaDataAPI";
	ОписаниеНастроек = "API ключ для сервиса DaData.ru";
	Пользователь = "Общие";
	
	СтруктураНастроек = Неопределено;
	СтруктураНастроек = ХранилищеОбщихНастроек.Загрузить(КлючОбъекта, КлючНастроек, ОписаниеНастроек, Пользователь);
	
	Если ЗначениеЗаполнено(СтруктураНастроек) Тогда
		КлючAPI = СтруктураНастроек.КлючAPI; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СохранитьКлючAPI();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура СохранитьКлючAPI()
	
	УстановитьПривилегированныйРежим(Истина);
	КлючОбъекта  = "DaData.ru";
	КлючНастроек = "DaDataAPI";
	ОписаниеНастроек = "API ключ для сервиса DaData.ru";
	Пользователь = "Общие";
	Настройки    = Новый Структура("КлючAPI", КлючAPI);
	ХранилищеОбщихНастроек.Сохранить(КлючОбъекта,  КлючНастроек, Настройки, ОписаниеНастроек, Пользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура НдаписьНастроитьПроверкуДублейНажатие(Элемент)
	ОткрытьФорму("Обработка.ДБ_ПроверкаДублей.Форма.ПоискДублей");
КонецПроцедуры

&НаКлиенте
Процедура НадписьВыборСтиляНажатие(Элемент)
	ОткрытьФорму("ОбщаяФорма.ДБ_ФормаВыбораСтиля");
КонецПроцедуры

#КонецОбласти
