
&НаСервере
Процедура ДБ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ПолеВвода = Элементы.Добавить(
		"ДБ_СтатусФизическихЛицКакНалогоплательщиковНДФЛДействуетДо",    //Имя элемента формы
		Тип("ПолеФормы"), //Тип, всегда ПолеФормы
		ЭтаФорма.Элементы["СтатусНалогоплательщикаГруппа"]);	      //Контейнер для поля ввода (Форма,Группа,Страница)
			
	ПолеВвода.Заголовок = "Действует до";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	
	//Установка связи элемента с данными
	ПолеВвода.ПутьКДанным = "ДБ_СтатусФизическихЛицКакНалогоплательщиковНДФЛДействуетДо";
		
	// Подготовить структуру отбора по измерениям     
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ФизическоеЛицо", ФизическоеЛицоСсылка);
	// Получить структуру с данными ресурсов записи
	СтруктураРесурсов = РегистрыСведений.ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.Получить(СтруктураОтбора);
	ДБ_СтатусФизическихЛицКакНалогоплательщиковНДФЛДействуетДо = СтруктураРесурсов.ДействуетДо;
	
КонецПроцедуры


Процедура СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛЗаписатьНаСервере(ФизическоеЛицо, ДействуетДо)
	Запись = РегистрыСведений.ДБ_СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛ.СоздатьМенеджерЗаписи();
	Запись.ФизическоеЛицо = ФизическоеЛицо;
	Запись.ДействуетДо = ДействуетДо;
	Запись.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ДБ_ОкПосле(Команда)
	СрокДействияСтатусаФизическихЛицКакНалогоплательщиковНДФЛЗаписатьНаСервере(ФизическоеЛицоСсылка, ДБ_СтатусФизическихЛицКакНалогоплательщиковНДФЛДействуетДо);
КонецПроцедуры
