#Область ОбработчикиСобытийФормы

&НаСервере
Процедура иб_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ИБ_ИспользоватьПодсказкуФИОDadata = Константы.ИБ_ИспользоватьПодсказкуФИОDadata.Получить() И ФизическоеЛицо.Ссылка.Пустая();
	ИБ_ИспользоватьПодсказкуEmailDadata = Константы.ИБ_ИспользоватьПодсказкуEmailDadata.Получить();
	
	Если ИБ_ИспользоватьПодсказкуEmailDadata Тогда
		
		Для Каждого Элемент_1 Из ЭтаФорма.Элементы.Страницы.ПодчиненныеЭлементы.ГруппаКонтактнаяИнформация.ПодчиненныеЭлементы Цикл
			
			Если Элемент_1.Заголовок = "Email" Тогда
				
				Для Каждого Элемент_2  Из Элемент_1.ПодчиненныеЭлементы Цикл
					Если Элемент_2.Вид = ВидПоляФормы.ПолеВвода Тогда
						Элемент_2.УстановитьДействие("АвтоПодбор", "иб_КонтактнаяИнформацияПолеEmailФизическиеЛицаАвтоПодборПосле");
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура иб_КонтактнаяИнформацияПолеEmailФизическиеЛицаАвтоПодборПосле(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ИБ_ИспользоватьПодсказкуEmailDadata Тогда
		
		Подсказки = ИБ_DaData.ПодсказкаПоEmail(Текст);
		
		Если Подсказки.suggestions.Количество() > 0 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДанныеВыбора = Новый СписокЗначений;
			
			Для Каждого email Из Подсказки.suggestions Цикл 
				ДанныеВыбора.Добавить(email.unrestricted_value, email.unrestricted_value);	
			КонецЦикла;
			
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура иб_ФИОАвтоПодборПосле(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ИБ_ИспользоватьПодсказкуФИОDadata Тогда
		
		Подсказки = ИБ_DaData.ПодсказкаПоФИО(Текст);
		
		Если Подсказки.suggestions.Количество() > 0 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДанныеВыбора = Новый СписокЗначений;
			
			Для Каждого ФИО Из Подсказки.suggestions Цикл 
				ДанныеВыбора.Добавить(ФИО.unrestricted_value, ФИО.unrestricted_value);	
			КонецЦикла;
			
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти