
&После("УстановкаПараметровСеанса")
Процедура ДБ_УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	Если ИменаПараметровСеанса <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Константы.ДБ_ИспользоватьНастройкуСтиля.Получить() Тогда
		Настройка = ХранилищеСистемныхНастроек.Загрузить("ДБ_НастройкиЦветаСтиля", "",, ИмяПользователя());
		Если ТипЗнч(Настройка) = Тип("Структура") Тогда
			Если ТипЗнч(Настройка) = Тип("Структура") Тогда
				Стиль = "";
				Если Настройка.Свойство("Стиль", Стиль) Тогда
					Если НЕ ПустаяСтрока(Стиль) И НЕ Стиль = "ДБ_Классический" Тогда
						ГлавныйСтиль = БиблиотекаСтилей[Стиль];
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
