
&После("ПередЗаписью")
Процедура иб_ПередЗаписью(Отказ)
	
	Если ЭтоНовый() И Константы.ИБ_ЗапретДублейДоговоров.Получить() И НЕ ТолькоОдинДоговорТакогоВида() Тогда
		ТекстСообщения = НСтр(СтрШаблон("ru = 'По контрагенту %1 уже есть договор с видом ""%2""'", Владелец, ВидДоговора));								
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , "Объект", Отказ);
	КонецЕсли
	
КонецПроцедуры

Функция ТолькоОдинДоговорТакогоВида()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|   ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов
	|   И НЕ ДоговорыКонтрагентов.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат ?(РезультатЗапроса.Количество() = 0, Истина, Ложь); 
	
КонецФункции


