
&После("ПередЗаписью")
Процедура иб_ПередЗаписью(Отказ)
	
	Если Константы.ИБ_ЗапретДублейКонтрагентов.Получить() Тогда 
		
		ДублиСправочникаКонтрагентыПоИННКПП = Справочники.Контрагенты.ПроверитьДублиСправочникаКонтрагентыПоИННКПП(СокрЛП(ИНН), СокрЛП(КПП), Ссылка);
		
		Если ДублиСправочникаКонтрагентыПоИННКПП.Количество() > 0 Тогда
			ТекстСообщения = НСтр(СтрШаблон("ru = 'Уже есть контрагент с такими данными'"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , "Объект", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
