#Область ОбработчикиСобытийФормы

&НаСервере
Процедура иб_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ИБ_ИспользоватьПодсказкуФИОDadata = Константы.ИБ_ИспользоватьПодсказкуФИОDadata.Получить() И Сотрудник.Ссылка.Пустая();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура иб_ФИОАвтоПодборПосле(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ИБ_ИспользоватьПодсказкуФИОDadata Тогда
		
		Подсказки = ИБ_DaData.ПодсказкаПоФИО(Текст);
		
		Если Подсказки.suggestions.Количество() > 0 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ДанныеВыбора = Новый СписокЗначений;
			
			Для Каждого ФИО Из Подсказки.suggestions Цикл 
				ДанныеВыбора.Добавить(ФИО.unrestricted_value, ФИО.unrestricted_value);	
			КонецЦикла;
			
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти