
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Синий		 = БиблиотекаКартинок["ДБ_Синий"];
	Нежный		 = БиблиотекаКартинок["ДБ_Нежный"];
	Розовый		 = БиблиотекаКартинок["ДБ_Розовый"];
	Зеленый		 = БиблиотекаКартинок["ДБ_Зеленый"];
	Античный	 = БиблиотекаКартинок["ДБ_Античный"];
	Молодежный	 = БиблиотекаКартинок["ДБ_Молодежный"];
	Классический = БиблиотекаКартинок["ДБ_Классический"];
	
	Настройка = ХранилищеСистемныхНастроек.Загрузить("ДБ_НастройкиЦветаСтиля", "",, ИмяПользователя());
	Если ТипЗнч(Настройка) = Тип("Структура") Тогда
		Стиль = "";
		Если Настройка.Свойство("Стиль", Стиль) Тогда 
			Если НЕ ПустаяСтрока(Стиль) Тогда
				Элементы.Стили.ТекущаяСтраница = ЭтаФорма.Элементы[Стиль];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьСтильНаСервере(Стиль)
	Настройка = ХранилищеСистемныхНастроек.Загрузить("ДБ_НастройкиЦветаСтиля", "",, ИмяПользователя());
	Настройка = Новый Структура("Стиль", Элементы.Стили.ТекущаяСтраница.Имя);
	ХранилищеСистемныхНастроек.Сохранить("ДБ_НастройкиЦветаСтиля", "", Настройка,, ИмяПользователя());
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтиль(Команда)
	УстановитьСтильНаСервере(Элементы.Стили.ТекущаяСтраница.Имя);
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Для установки стиля потребуется перезапустить. Сделать это сейчас?'"), Режим,0);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        ЗавершитьРаботуСистемы(Истина, Истина,);
    КонецЕсли;
КонецПроцедуры