
&ИзменениеИКонтроль("ОпределитьНастройки")
Процедура иб_ОпределитьНастройки(Настройки)

	Если Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		// В неразделенном режиме не нужно определять настройки
		Возврат;
	КонецЕсли;

#Удаление
	Если НЕ ОбщегоНазначенияБП.ОткрыватьДополнительныеОкнаПриЗапуске() Тогда
		Настройки.Показывать = Ложь;
	КонецЕсли;
#КонецУдаления
#Вставка
Если Константы.ИБ_ОтключитьДополнительныеОкнаПриЗапуске.Получить() Тогда
	Настройки.Показывать = Ложь;
Иначе
	Если НЕ ОбщегоНазначенияБП.ОткрыватьДополнительныеОкнаПриЗапуске() Тогда
		Настройки.Показывать = Ложь;
	КонецЕсли;
КонецЕсли;
#КонецВставки

КонецПроцедуры
